import string


alphabet28 = string.ascii_lowercase + ' _' # 26 is space, 27 is CTC blank char
alphabet87 = string.ascii_lowercase + string.ascii_uppercase + string.digits + ' +-*.,:!?%&$~/()[]<>"\'@#_'

dict838 = '마이팜약병원처방라프레시아의조제가솥손두부김진문퍼센트국내산콩으로직접빚은토종순대야성중요리백고추장삼채전점을빛정식묵지치찜매운갈비예년통어탕평단체한돈인증자금감악꼬기꾸서오세생칠횟집층입니다작불곰육사밥루강수돌영양촌막닭콘도형민박십동주춘천메밀거철역무료행당화네꽃게침구림밴댕덮우럭활회빔음돼굴창맹바해경명선암굽는람들포래울에신걸환합참맛느껴보려숯휴왕까스카노소석관연완펜션탄칼뚝배황태물모떡향택하새개깡청골홍족발녹빈념쇠광범좋편찌찬와일짬뽕옛날짜면계절별미셋귀복분그린호크똘칡냉님섬낙있됩길상설렁쑥옥특남용차겹살재깨반된나테멍폴앉뱅번류찻늘른뉴송풍버섯할납너샤브코커피숍갤러락능랑쭈말뼈푸알목달콤후런디저페품농군판령머횡건볶궐안둔만밭벌흑담함갑꿩흥더덕잔심깃든변없되겠습출실업봉속과픽놔임여빙벙글꿈멸드럼등딸본죽또먹듭띠독애견근앙유학술외법표최례냅칫베큐파티초쌀욕놀맵필렵협곡팥몸웰죠타현뜰쌈삶열얼큰짝궁블축몽뻘따친염색공란빵르릅를셀객줄였왔월터징캉밤즉푼었간뷔곱누룽숙교벽및승득격올랍난팰룡위갱북때맥띄웠허첩빗곤량논각낚슬져쏘패키워쟁팔항뒤텔희굿닝충홀탁둥듬빌딩젓솔둠척엄붕쿠숟츠찐쌍잣썬씨데줘폰싸램룸튀닷폭욱착꺽닮홈꼼첫째뽑뒷짚총깔뿌잡녀셰쪽칸숭멧권샐익엔눈썹름효숫옷궤죄맷젊빠캐쥬잠며겐헤적던킨슈뇨혁력클럽렉앤넌땡긴헬좌뽀혜윤델책쿡벤샵틱몰케랜혼봄뎅롱온준쇄앗짐딧킹듯잘플랩결춤걱끼넷듀팡컴텍널눔규믹벅움뛰잇댄릭떼찰컬샘썰툰팩쓰릉솝핫밍망즈풀랙녕낯벚엘탐꿀잌켓쏭텐멀뮤쉬왜숨퓨웨답겨꼭컵했쁜즘벨투싰멘렛펌릴존슨밧맨걷롬융윌빨늬랭헨탈흙쇼튜쁘몬밸끗얄옵롯뚜썸윈뷰햇냠헌혈왈픈닉펄덤립끝엠렌팟뱃툇컷팅엉샌곽똥값끌첸톤럴험숲맞륵댐옹얀슐련챔언댁웅취힐링탑묘킴둘히갓갯곳앞극퇴틴퀼율셔틀퀘획얏턴끄쉼퀴' + string.ascii_lowercase + string.ascii_uppercase + string.digits + ' +-*.,:!?%&$~/()[]<>"\'@#_'

def decode(chars):
    blank_char = '_'
    new = ''
    last = blank_char
    for c in chars:
        if (last == blank_char or last != c) and c != blank_char:
            new += c
        last = c
    return new
